//1 .  რა არის ამოცანის მიზანი ? =  დავწერო ფუქნცია რომელსაც გადაეცემა ორი არგუმენტი, 
           // რომელიც დაითვლის რამდენ სხვადასხვა წყვილშ შეიძლება ჩაჩჯეს  გადაცემული რიცხვი. 
//2.ამ დავალებაში რა არის ჩემი input ?? -  array -  მასივი. და num -  რომელიც უნდა ჩაჯდეს მასივში პირობის მიხედვით. 
//3.ამ დავალებაში ჩემი output - არის , რომ  დამიბრუნუს ფუნქციამ  თუ რამდენ  წყვილში  ჩაჯდეს ეს num რიცხვი. 
//4.  ფუნქციაში მაქვს ორი მტავარი ლოგიკა :
     //1. თუ num არის ლუწი - შეიძლება ჩაჯდეს მხოლოდ იმ წყვილებში, სადაც ერთ ერტი რიცხვი არის ლუზი , ან ორივე არის ლუწი. 
     //2. თუ num არის კენტი -  შეიძლება ჩაჯდეს მხოლოდ იმ წყვილებში,სადაც ერთ ერტი რიცხვი არის კენტია , ან ორივე არის კენტი. 
// ჩემი agde case  : თუ მასივში 2 ზე ნაკლები ელემენტია დამიბრუნოს ნო , რადგან წვილისთვი ორი ელემენტი გვჭირდება
             	

const array= [0, 4, 6, 8]
const num = 10;
function availableCouple(array, num) {
    if (array.length < 2) {
             return 0;
    }
   let pairCount = 0
   for (let i = 0; i < array.length - 1; i++) {
        let singleNum =  array[i];
        let doubleNum = array[i + 1];
        if (num % 2 === 0) {
            if(singleNum % 2 === 0  || doubleNum % 2 === 0){
                pairCount ++
            }
        } else {
            if(singleNum % 2 === 1 || doubleNum % 2 === 1){
                pairCount ++
            }
        }
   }return pairCount;
}
console.log(availableCouple(array , num));
 



             